# DissolveUnableToDissolveForm Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FormFailures..::..DissolveUnableToDissolveForm Property
BuiltInFailures..::..FormFailures Class See Also
---
Unable to dissolve form element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DissolveUnableToDissolveForm { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DissolveUnableToDissolveForm As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DissolveUnableToDissolveForm {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FormFailures Class
Autodesk.Revit.DB Namespace